'''
컴프리헨션은 입력 시퀀스에 있는 각 값별로 아이템을 하나씩 생성
새 리스트를 통째로 생성.
값이 크면 메모리를 많이 소모해서 프로그램을 망가뜨리는 원인이 됨.

제너레이터 표현식(generator expression) 사용!!
1. generator(발생, 생성원) 은 실행될때 출력 시퀀스를 메모리에 올리지 않음.
2. 표현식에서 한번에 한 아이템을 내주는 이터레이터(iterator)로 평가됨
3. 제너레이터를 연결하면 파이썬에서 빠르게 실행 가능.
4. 이터레이터를 한번 넘게 사용하지 않도록 고려하자

'''

#입력 값이 적을때만 사용하도록 하자
value = [len(x) for x in open('filename')]

#제너티레이터 표현식은 즉시 이터레이터로 평가되므로 진행이 안됨.
it = (len(x) for x in open('filename'))

#내장 암수에 반환 받은 이터레이터를 하나씩 전진시킴
next(it)

#다른 제너레이터와 함께 사용가능. 위에서 생성한 it을 사용하였음.
roots = ((x, x**0.5) for x in it)
next(roots)
